In [2]:
import pandas as pd

In [5]:
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})

In [6]:
print(data)

[[1, 3], [2, 1]]

In [14]:
print(orders)

   id  customerId
0   1           3
1   2           1

In [15]:
print(customers)

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [19]:
df = customers[~customers['id'].isin(orders['customerId'])]
df

   id   name
1   2  Henry
3   4    Max

In [12]:
df[['name']].rename(columns = {'name':'Customers'})

  Customers
1     Henry
3       Max

In [20]:
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

In [21]:
print(views)

   article_id  author_id  viewer_id  view_date
0           1          3          5 2019-08-01
1           1          3          6 2019-08-02
2           2          7          7 2019-08-01
3           2          7          6 2019-08-02
4           4          7          1 2019-07-22
5           3          4          4 2019-07-21
6           3          4          4 2019-07-21

In [28]:
df = views[views['author_id'] == views['viewer_id']].drop_duplicates()[['author_id']].rename(columns = {'author_id':'id'}).sort_values(by=['id'])
df

   id
5   4
2   7

In [29]:
data = [[1, 'Let us Code'], [2, 'More than fifteen chars are here!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})

In [37]:
tweets[tweets['content'].str.len()>15][['tweet_id']]

   tweet_id
1         2

In [3]:
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

In [14]:
employees['bonus'] = 0

In [19]:
employees.loc[(employees['employee_id'] % 2 != 0) & (~employees['name'].str.startswith('M')),'bonus'] = employees['salary']

In [20]:
employees

   employee_id     name  salary  bonus
0            2     Meir    3000      0
1            3  Michael    3800      0
2            7  Addilyn    7400   7400
3            8     Juan    6100      0
4            9   Kannon    7700   7700

In [21]:
result_df = employees[['employee_id', 'bonus']].sort_values(by='employee_id', ascending=True)

In [22]:
data = [[1, 'aLice'], [2, 'bOB']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})

In [23]:
users['name'] = users['name'].str.title()

In [24]:
users

   user_id   name
0        1  Alice
1        2    Bob

In [3]:
data = [[1, 'Winston', 'winston@leetcode.com'], [2, 'Jonathan', 'jonathanisgreat'], [3, 'Annabelle', 'bella-@leetcode.com'], [4, 'Sally', 'sally.come@leetcode.com'], [5, 'Marwan', 'quarz#2020@leetcode.com'], [6, 'David', 'david69@gmail.com'], [7, 'Shapiro', '.shapo@leetcode.com']]
users = pd.DataFrame(data, columns=['user_id', 'name', 'mail']).astype({'user_id':'int64', 'name':'object', 'mail':'object'})

In [9]:
pd = users['mail'].str

In [10]:
pd

In [40]:
import pandas as pd
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['Id', 'Salary']).astype({'Id':'Int64', 'Salary':'Int64'})
N = 100

In [44]:
data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).astype({'product_id':'Int64', 'store1':'Int64', 'store2':'Int64', 'store3':'Int64'})

In [45]:
products

   product_id  store1  store2  store3
0           0      95     100     105
1           1      70    <NA>      80

In [55]:
hung = products.melt(id_vars = ['product_id'],value_vars = ['store1','store2','store3'],var_name='store',value_name = 'price').dropna()

In [56]:
hung

   product_id   store  price
0           0  store1     95
1           1  store1     70
2           0  store2    100
4           0  store3    105
5           1  store3     80

In [23]:
import pandas as pd
data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [24]:
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [25]:
department

   id   name
0   1     IT
1   2  Sales

In [43]:
merged = employee.merge(department , left_on = 'departmentId' , right_on = 'id')
merged

   id_x name_x  salary  departmentId  id_y name_y
0     1    Joe   70000             1     1     IT
1     2    Jim   90000             1     1     IT
2     3  Henry   80000             2     2  Sales
3     4    Sam   60000             2     2  Sales
4     5    Max   90000             1     1     IT

In [46]:
merged[merged['salary'] == merged.groupby('name_y')['salary'].transform(max)]

C:\Users\hoang\AppData\Local\Temp\ipykernel_12728\3480106749.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  merged[merged['salary'] == merged.groupby('name_y')['salary'].transform(max)]

   id_x name_x  salary  departmentId  id_y name_y
1     2    Jim   90000             1     1     IT
2     3  Henry   80000             2     2  Sales
4     5    Max   90000             1     1     IT

In [40]:
rt

   id_x name_x  salary  departmentId  id_y name_y
1     2    Jim   90000             1     1     IT
2     3  Henry   80000             2     2  Sales
4     5    Max   90000             1     1     IT